tecno_machines.tex
% Created 2017-08-29 Tue 21:13
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\author{David Pineda Osorio @Pineiden}
\date{\today}
\title{The web in \emph{real time}}
\hypersetup{
 pdfauthor={David Pineda Osorio @Pineiden},
 pdftitle={The web in \emph{real time}},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.4.1 (Org mode 9.0.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Creation of Techno Machines}
\label{sec:orgf4ee783}

Here we will learn some wonderful and hard things. Maybe i couldn't obtain all the knowledge about 
all necessary  to handle real time systems but the contents that i will provide to you will be worth it.
With all of that you can start a little application and with some more research create a wonderful techno
machine that will wonder all people.

This content is created with my living work and i intend to contribute to the commonwealth. Hence i invite 
you to do the same. Learn, create and share with the humanity your work, create commonwealth.

The technologies used in this contents are avalaible on the web and i recommend to use Gnu/Linux, some distribution
of the Debian family (Debian, Mint, Ubuntu, etc). You have to go deep on different languages: bash, python, javascript, 
typescript, erlang, postgres; and design patterns: observer pattern, model-view-controller pattern, etc.

\section{Install and configure the technologies}
\label{sec:org9093205}

\subsection{IDEs}
\label{sec:org14488ab}

\subsection{Python}
\label{sec:org201f6c1}

\subsection{Virtual Environment}
\label{sec:org5d52381}

\subsection{Django}
\label{sec:org2f28669}

\subsection{Postgres}
\label{sec:org449c77e}

\subsection{RabbitMQ}
\label{sec:org77634ef}

\subsection{Angular}
\label{sec:org2103d73}

\section{A General Schema}
\label{sec:orgd905d87}

\section{The Backend}
\label{sec:org35dec3f}

\section{The Channel}
\label{sec:orgc21e8f0}

\section{The Frontend}
\label{sec:org42ec995}

\section{The Messages}
\label{sec:org65ad6da}

\section{The End}
\label{sec:org7ea6b72}
\end{document}
